src/test/java/comdao/eop/MDM供应商清单主数据同步反馈接口/入参.txt

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">\r
   <SOAP:Header>\r
      <Esb>\r
         <Route>\r
            <Sender>10.1208</Sender>\r
            <Time>20181116</Time>\r
            <ServCode>10.1118.mdmdatasyncproxy.AsynReq</ServCode>\r
            <MsgId>MDM_ZCSYBM_20181116181453_tfa2L_SMRH_99</MsgId>\r
            <EsbId>0e3e92a5ada3e150d33460d26aef2a13</EsbId>\r
         </Route>\r
      </Esb>\r
   </SOAP:Header>\r
   <SOAP:Body>\r
      <ns0:MT_MDM_GENERAL xmlns:ns0="urn:telecom:mss:jt:mdm">\r
         <ROOT>\r
            <TYPE_NAME>ZTCBLB</TYPE_NAME>\r
            <ITEM>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>ZZ_ZCLB</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>60803</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>ZZCLB_LDEC</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>动力电源设备</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>STATUS</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>10</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>REMARK1</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>EVENT_HQ_20191217_7425</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>REMARK2</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE/>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>REMARK3</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE/>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>REMARK4</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE/>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>REMARK5</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE/>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>ZZKEY1</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>10</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>ZZKEY2</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>03</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>ZZKEY3</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>05</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>ZZKEY4</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>02</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
               <ITEM_FIELD>\r
                  <ITEM_FIELD_NAME>ORD41</ITEM_FIELD_NAME>\r
                  <ITEM_FIELD_VALUE>A001</ITEM_FIELD_VALUE>\r
               </ITEM_FIELD>\r
            </ITEM>\r
         </ROOT>\r
      </ns0:MT_MDM_GENERAL>\r
   </SOAP:Body>\r
</SOAP:Envelope>